; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v8 ?v6)
		(pred_1 ?v4)
		(pred_2 ?v2)
		(pred_3 ?v2)
		(pred_4 ?v4 ?v2)
		(pred_5)
		(pred_6 ?v4))

   (:action op_2
       :parameters  (?v1 ?v3)
       :precondition (and (not-eq ?v1 ?v3) 
                          (pred_2 ?v1) (pred_2 ?v3) (pred_3 ?v1))
       :effect (and  (pred_3 ?v3)
		     (not (pred_3 ?v1))))


   (:action op_1
       :parameters (?v7 ?v5)
       :precondition  (and  (pred_1 ?v7) (pred_2 ?v5)
			    (pred_4 ?v7 ?v5) (pred_3 ?v5) (pred_5))
       :effect (and (pred_6 ?v7)
		    (not (pred_4 ?v7 ?v5)) 
		    (not (pred_5))))

   (:action op_3
       :parameters  (?v7  ?v5)
       :precondition  (and  (pred_1 ?v7) (pred_2 ?v5)
			    (pred_6 ?v7) (pred_3 ?v5))
       :effect (and (pred_4 ?v7 ?v5)
		    (pred_5)
		    (not (pred_6 ?v7)))))

; problem
(define (problem ferry-l6-c2)
(:domain ferry)
(:objects obj_01 obj_03 obj_05 obj_02 obj_06 obj_08 
          obj_07 obj_04 
)
(:init
(pred_2 obj_01)
(pred_2 obj_03)
(pred_2 obj_05)
(pred_2 obj_02)
(pred_2 obj_06)
(pred_2 obj_08)
(pred_1 obj_07)
(pred_1 obj_04)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_08)
(not-eq obj_08 obj_01)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_08)
(not-eq obj_08 obj_03)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_08)
(not-eq obj_08 obj_05)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_08)
(not-eq obj_08 obj_02)
(not-eq obj_06 obj_08)
(not-eq obj_08 obj_06)
(pred_5)
(pred_4 obj_07 obj_08)
(pred_4 obj_04 obj_08)
(pred_3 obj_05)
)
(:goal
(and
(pred_4 obj_07 obj_08)
(pred_4 obj_04 obj_02)
)
)

(:constraints
  (sometime-before  (pred_4 obj_04 obj_02) (pred_3 obj_01))
)
)

; plan
1. (op_2 obj_05 obj_08)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_08)
   goals met: 1 of 2
2. (op_1 obj_07 obj_08)
   deleted: (pred_4 obj_07 obj_08) (pred_5)
   added: (pred_6 obj_07)
   goals met: 0 of 2
3. (op_2 obj_08 obj_01)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_01)
   goals met: 0 of 2
4. (op_3 obj_07 obj_01)
   deleted: (pred_6 obj_07)
   added: (pred_4 obj_07 obj_01) (pred_5)
   goals met: 0 of 2
5. (op_2 obj_01 obj_08)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_08)
   goals met: 0 of 2
6. (op_1 obj_04 obj_08)
   deleted: (pred_4 obj_04 obj_08) (pred_5)
   added: (pred_6 obj_04)
   goals met: 0 of 2
7. (op_2 obj_08 obj_02)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_02)
   goals met: 0 of 2
8. (op_3 obj_04 obj_02)
   deleted: (pred_6 obj_04)
   added: (pred_4 obj_04 obj_02) (pred_5)
   goals met: 1 of 2
9. (op_2 obj_02 obj_01)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_01)
   goals met: 1 of 2
10. (op_1 obj_07 obj_01)
   deleted: (pred_4 obj_07 obj_01) (pred_5)
   added: (pred_6 obj_07)
   goals met: 1 of 2
11. (op_2 obj_01 obj_08)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_08)
   goals met: 1 of 2
12. (op_3 obj_07 obj_08)
   deleted: (pred_6 obj_07)
   added: (pred_4 obj_07 obj_08) (pred_5)
   goals met: 2 of 2
